[
  {
    "title": "The Gospel of the Kingdom",
    "theme": "Matthew 4:23",
    "date": "2021-12-01",
    "preacher": "Rev. Dr. Lloyd-Jones",
    "sermon": "Do we know what the Gospel is? A great tragedy today, even among professing Christians, is not knowing what the Gospel of Jesus Christ is. In this Christmas message, Dr. Martyn Lloyd-Jones preaches on the message that frames the beginning and end of the Lord Jesus’ ministry. By looking at both Matthew 4:23 and 24:14, he explores the message of the Gospel from the perspective of the Kingdom of God. The good news of God’s Kingdom (or His rule and reign), says Dr. Lloyd-Jones reminds us of the greatness of the Gospel. We are often guilty of reducing the Gospel to subjective terms such as our personal happiness or peace. We often start with ourselves and end with ourselves. But as Dr. Lloyd-Jones teaches, the Gospel of the Kingdom reminds us that the whole world is involved in God’s redemption. The good news of the Kingdom reminds us that the Son of God came to this earth, not to simply make us respectable people, but to make us obedient to God. Our obedience to the King brings Him glory. Listen as Dr. Lloyd-Jones answers the most important question of all: why was it necessary for Jesus Christ to come into the world?"
  },
  {
    "title": "Reconciled to God",
    "theme": "Matthew 9:1-8",
    "date": "2022-01-01",
    "preacher": "Rev. Dr. Lloyd-Jones",
    "sermon": "What is the greatest need in your life? Maybe you are in a financial bind, have some broken relationships or a physical ailment that is bringing you down; but if those all were fixed, would you have a perfect life? In this sermon on Matthew 9:1-8, Dr. Martyn Lloyd-Jones preaches through the account of the paralyzed man who's greatest need was fixed by Jesus. This man had heard that Jesus could heal him and had faith that Jesus could do it. His faith brought him to have his friends lower him through a roof to get to Jesus; he was a desperate man. Yet Jesus offers something so much more than just the physical healing of the man – Jesus forgives his sins. Dr. Lloyd-Jones reminds listeners that unless our sins have been forgiven, we are not able to live a truly happy life regardless of how \"good\" our situation may be. Jesus is the only one who has the power and authority to forgive man of their sins. He alone can save, and we must come to Him with faith like the paralytic. Has your greatest problem been solved? If it has, then be of good cheer, there is nothing greater than this! If not, the Savior is always ready to forgive needy sinners."
  },
  {
    "title": "New Wineskins",
    "theme": "Matthew 9:16-17",
    "date": "2022-02-01",
    "preacher": "Rev. Dr. Lloyd-Jones",
    "sermon": "What is at the center of Jesus’ message? What is at the heart of all the parables and teachings of Jesus? According to Dr. Martyn Lloyd-Jones in this message from Matthew 9:16-17, it is not the external ritualistic religion that is found in many churches today, nor is it the message of works righteousness. But at the heart of the message of Jesus is the truth that the Gospel is the power of God to save! It is the truth that Jesus is the Messiah who has come to die for sinners. By the working of the Holy Spirit, sinners can repent and believe in Jesus. They can be set free from sin and the wrath of God because of the Gospel! The very presence of the Gospel transforms man and confronts sin, it destroys the old life and breathes new life in Christ. What does this message mean for each and every one of us? The Gospel is a call to believe in Jesus for the forgiveness of sins. It is a call to experience the new life in Christ free from sin and evil. The Gospel calls all to repent of their sins and trust in Jesus."
  },
  {
    "title": "The Free Gift of God's Grace",
    "theme": " Matthew 20:1-16",
    "date": "2022-03-01",
    "preacher": "Rev. Dr. Lloyd-Jones",
    "sermon": "Don’t misunderstand the Kingdom of God. In an age where people are clamoring for fairness, it can be hard for Christians to stand strong on the biblical teachings regarding salvation and eternal life. The parable in this sermon reinforces that we are in grave danger of misunderstanding the Kingdom of God and the reason that Jesus came, and consequently, we must take active steps to guard against this. Dr. Martyn Lloyd-Jones takes the listener through Matthew 20:1-16, showing its emphasis that the claims of the Kingdom of God oftentimes come as a surprise and against the grain of what the natural man would assume to be true. Yet, it is through these very truths that Scripture also helps us to glean crucial truths about God and eternity. This parable, he explains, shows the difference between a true and a false salvation. Many misunderstand the Kingdom of God and hold to a false salvation that is rooted in the belief that eternal life is a reward for a good life on earth. But besides offering no hope to a sinful person, it misses the entire glory of our free salvation in Christ — every one of us justly deserve hell because we have all broken God’s Law, yet Christ was offered as an acceptable substitute in our place in the reception of God’s wrath. Don’t misunderstand the Kingdom of God — salvation has been offered to you. Repent and believe today."
  },
  {
    "title": "The Power of the Gospel",
    "theme": "Mark 1:1",
    "date": "2022-04-01",
    "preacher": "Rev. Dr. Lloyd-Jones",
    "sermon": "What is the Gospel? The answer to this simple question has ultimate meaning for the lives of each and every one of us. As Dr. Martyn Lloyd-Jones teaches from Mark 1:1, many look for answers to the problems they face in the world, whether it is religion, politics, philosophy. But the true answer is in the message that came two thousand years ago in the person of Christ. For Christ was born a baby in the lowly place of Bethlehem, yet the hope of all men is in this one man. Only Jesus can redeem us from sin and make all things new. Only Jesus can forgive our sins and give us peace with God. What then is the Gospel? The Gospel is the message of salvation that Jesus has died in order that all who believe in Him might be saved. It is the only message that God has given; all others are counterfeits. Dr. Lloyd-Jones asks the critical question: do you believe in Jesus? This sermon will help you answer that question of eternal importance."
  }
]
